# 경마 데이터 가져오기

In [1]:
import numpy as np
import pandas as pd
from sqlalchemy import create_engine

In [2]:
engine = create_engine('mysql://root:kdpark81@localhost/racing', convert_unicode=True)
conn = engine.connect()

In [3]:
data = pd.read_sql_table('hr_race', conn)
data.head()

,id,rcDate,meet,rcNo,ord,rcTime,age,chulNo,corner_txt,differ,hrName,jkName,owName,plc,prdCtyNm,sex,trName,wgBudam,wgHr,win
0,1,2000-01-30,서울,1,3.0,01:20:01,4,1,- - - 10 - 9 -,4,웨스턴타이틀,함완식,이근우,1.1,호,암,김문갑,54.0,461.0,1.6
1,2,2000-01-30,서울,1,11.0,01:22:00,4,2,- - - 7 - 7 -,2,두루미,박수홍,범양해운,31.5,한,암,이왕언,53.0,428.0,610.6
2,3,2000-01-30,서울,1,12.0,01:22:01,5,3,- - - 12 - 11 -,2½,서천,박동랑,어울림네트웍스,5.8,뉴,암,김문갑,52.0,391.0,52.1
3,4,2000-01-30,서울,1,8.0,01:21:01,4,4,- - - 8 - 8 -,½,런패스터,김동균,성환옥,2.3,미,암,최혜식,52.0,423.0,17.0
4,5,2000-01-30,서울,1,10.0,01:22:00,4,5,- - - 11 - 12 -,¾,한가람,이정선,이영욱a,24.8,뉴,암,최영주,52.0,442.0,732.4

In [4]:
data.info()
conn.close()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 466783 entries, 0 to 466782
Data columns (total 20 columns):
id            466783 non-null int64
rcDate        466783 non-null datetime64[ns]
meet          466783 non-null object
rcNo          466783 non-null int64
ord           453232 non-null float64
rcTime        454858 non-null object
age           466783 non-null int64
chulNo        466783 non-null int64
corner_txt    466783 non-null object
differ        418181 non-null object
hrName        466783 non-null object
jkName        466783 non-null object
owName        466783 non-null object
plc           461067 non-null float64
prdCtyNm      466783 non-null object
sex           466783 non-null object
trName        466783 non-null object
wgBudam       466783 non-null float64
wgHr          466064 non-null float64
win           461091 non-null float64
dtypes: datetime64[ns](1), float64(5), int64(4), object(10)
memory usage: 71.2+ MB

## DataFrame to csv
인코딩이 귀찮다 파이썬3으로 옮기자

In [5]:
data.to_csv("../Dataset/hr_race.csv", encoding="utf-8")